Dataframe.insert(loc, column, value, allow_duplicates=False): 在Dataframe的指定列中插入数据。

参数介绍：

       loc:  int型，表示第几列；若在第一列插入数据，则 loc=0

       column: 给插入的列取名，如 column='新的一列'

       value：数字，array，series等都可（可自己尝试）

       allow_duplicates: 是否允许列名重复，选择Ture表示允许新的列名与已存在的列名重复。

In [2]:
import numpy as np
import pandas as pd

In [5]:
data = pd.DataFrame(np.arange(16).reshape(4, 4), columns=list('abcd'))
data

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [26]:
#在第一列插入一列，取名'haha'
data.insert(loc=0,column='haha',value=6)

In [29]:
# 在第一列插入一列，取名'haha'（重复选择允许）
# data.insert(loc=0,column='haha',value=6，allow_duplicates=True)

In [35]:
data['new_col']=3
data

         haha   a   b   c   d  new_col
0           6   0   1   2   3        3
1           6   4   5   6   7        3
2           6   8   9  10  11        3
3           6  12  13  14  15        3
new_row    12  12  12  12  12        3

In [36]:
data.loc['new_row']=12
data

         haha   a   b   c   d  new_col
0           6   0   1   2   3        3
1           6   4   5   6   7        3
2           6   8   9  10  11        3
3           6  12  13  14  15        3
new_row    12  12  12  12  12       12